ГТС/УТГТС/Reports/ИзменениеABCXYZРаспределенияКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ИзменениеABCXYZРаспределенияКлиентов</Name>
		</Properties>
	</Report>
</MetaDataObject>

ГТС/УТГТС/Enums/ABCКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ABCКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/XYZКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>XYZКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Reports/ИзменениеABCXYZРаспределенияКлиентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает текстовое описание классификации по значениям ABC/XYZ классов
//
// Параметры:
//  ABC - ПеречислениеСсылка.ABCКлассификация - значение ABC классификации,
//  XYZ - ПеречислениеСсылка.XYZКлассификация - значение XYZ классификации.
//
// Возвращаемое значение:
//   Строка - строковое представление класса
//
Функция ПолучитьПредставлениеКлассификации(ABC, XYZ) Экспорт

	ПредставлениеABC = ПолучитьОписаниеКласса(ABC);
	ПредставлениеXYZ = ПолучитьОписаниеКласса(XYZ);
	
	Возврат ПредставлениеABC + ", " + ПредставлениеXYZ;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИзменениеABCXYZРаспределенияКлиентов);
	ОписаниеОтчета.Описание = НСтр("ru = 'Изменение ABC/XYZ - распределения клиентов.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ОписаниеОтчета);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Возвращает текстовое описание класса по его значению
//
// Параметры:
//  ЗначениеКласса - ПеречислениеСсылка.ABCКлассификация, ПеречислениеСсылка.XYZКлассификация - значение класса, для
//      которого нужно определить описание.
//
// Возвращаемое значение:
//   Строка - строковое представление класса
//
Функция ПолучитьОписаниеКласса(ЗначениеКласса)

	Если ЗначениеКласса = Перечисления.ABCКлассификация.ПустаяСсылка() Тогда
		Возврат НСтр("ru='потенциальный клиент(ABC)'");
	ИначеЕсли ЗначениеКласса = Перечисления.ABCКлассификация.НеКлассифицирован Тогда
		Возврат НСтр("ru='потерянный клиент(ABC)'");
	ИначеЕсли ЗначениеКласса = Перечисления.XYZКлассификация.ПустаяСсылка() Тогда
		Возврат НСтр("ru='потенциальный клиент(XYZ)'");
	ИначеЕсли ЗначениеКласса = Перечисления.XYZКлассификация.НеКлассифицирован Тогда
		Возврат НСтр("ru='потерянный клиент(XYZ)'");
	Иначе
		Возврат Строка(ЗначениеКласса);
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
